#include<stdio.h>
#include <conio.h>
#include <Windows.h>

void setconsleview() {
	system("mode con:cols=80 lines=30");
}// 콘솔창 크기

void gotoxy(int x, int y) {
	HANDLE consolehandle = GetStdHandle(STD_OUTPUT_HANDLE);
	COORD pos = { x, y };
	SetConsoleCursorPosition(consolehandle, pos);  //커서 위치 고정시키는 함수
}

int day1() {
	printf("================================================================================\n");
	printf("★ Day.1 고양이를 마주쳤다. 어떻게 할까?\n");
	printf("1.간식을 준다. \n");
	printf("2.따뜻한 눈빛으로 쳐다만 본다. \n");
	printf("3.'저리가'라고 소리친다. \n");
	printf("================================================================================\n");

}

int day2() {
	printf("================================================================================\n");
	printf("★ Day.2 어제 봤던 고양이를 또 마주쳤다. 어떻게 할까?\n");
	printf("1.간식을 준다. \n");
	printf("2.꼬리를 만져본다. \n");
	printf("3.손으로 놀아준다. \n");
	printf("================================================================================\n");
}

int day3() {
	printf("================================================================================\n");
	printf("★ Day.3 고양이가 낮잠을 자고 있다. 어떻게 할까?\n");
	printf("1.따듯한 잠자리를 위해 핫팩을 끼워준다. \n");
	printf("2.후~ 바람을 불어서 깨운다. \n");
	printf("3.아무것도 하지 않은채 지나간다. \n");
	printf("================================================================================\n");
}

int day4() {
	printf("================================================================================\n");
	printf("★ Day.4 고양이가 비닐봉지를 가지고 놀고있다. 어떻게 할까?\n");
	printf("1.봉투 손잡이에 목이 졸릴 위험이 있다. 비닐봉지를 뺏는다. \n");
	printf("2.비닐봉지를 뭉쳐서 던져준다. \n");
	printf("3.고양이인척 함께 비닐봉지와 싸운다. \n");
	printf("================================================================================\n");
}

int day5() {
	printf("================================================================================\n");
	printf("★ Day.5 고양이가 높은 나무위에 올라가있다. 위급한 상황이다. 어떻게 할까?\n");
	printf("1.나무를 타서 고양이를 구출한다. \n");
	printf("2.119에 신고한다. \n");
	printf("3.나는 고소공포증이다.. 그냥 지나친다. \n");
	printf("================================================================================\n");

}


int main() {
	setconsleview();

	char key;
	
	
}